#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```
terraform
Acquiring state lock. This may take a few moments...
openstack_compute_secgroup_v2.ssh: Refreshing state... [id=f4091969-aab8-4e55-a56e-316aba5adfa0]
openstack_compute_instance_v2.cloud-info: Refreshing state... [id=a8552546-954c-4c63-b6d4-c226a65d930b]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # openstack_compute_instance_v2.cloud-info must be replaced
-/+ resource "openstack_compute_instance_v2" "cloud-info" {
      ~ access_ip_v4        = "192.168.13.121" -> (known after apply)
      + access_ip_v6        = (known after apply)
      ~ all_metadata        = {} -> (known after apply)
      ~ all_tags            = [] -> (known after apply)
      ~ availability_zone   = "brno1" -> (known after apply)
      ~ flavor_name         = "standard.medium" -> (known after apply)
      ~ id                  = "a8552546-954c-4c63-b6d4-c226a65d930b" -> (known after apply)
      ~ image_name          = "ubuntu-bionic-x86_64" -> (known after apply)
        name                = "cloud-info"
      + region              = (known after apply)
      - tags                = [] -> null
      ~ user_data           = "91273713ba8e7926b1731fb704b83a5fe95e4d56" -> "72a1f2b59ad46687f61203a836e190b9090d76a2" # forces replacement
        # (6 unchanged attributes hidden)

      ~ network {
          ~ fixed_ip_v4    = "192.168.13.121" -> (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          ~ mac            = "fa:16:3e:04:b8:3e" -> (known after apply)
          ~ name           = "demofedcloud" -> (known after apply)
          + port           = (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @enolfc, Action: `pull_request`*